zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_rtc_ex.h
  uint32_t tampSecureFull;            /*!< Specifies If the TAMP is fully secured or not execpt monotonic counters and
                                           BackUp registers.
                                           This parameter can be a value of @ref RTCEx_TAMP_Secure_Full */

  uint32_t backupRegisterStartZone2;  /*!< Specifies the backup register start zone 2
                                           Zone 1 : read secure write secure.
                                           Zone 2 : read non-secure  write secure.
                                           This parameter can be RTC_BKP_DRx where x can be from 0 to 31 to
                                           specify the register.
                                           Warning : this parameter is shared with RTC_PrivilegeStateTypeDef. */

  uint32_t backupRegisterStartZone3;  /*!< Specifies the backup register start zone 3
                                           Zone 3 : read non-secure  write non-secure
                                           This parameter can be RTC_BKP_DRx where x can be from 0 to 31 to
                                           specify the register.
                                           Warning : this parameter is shared with RTC_PrivilegeStateTypeDef. */

  uint32_t MonotonicCounterSecure;    /*!< Specifies If the monotonic counter 1 is secured or not
                                           This parameter can be a value of @ref RTCEx_TAMP_Monotonic_Counter_Secure */

  uint32_t MonotonicCounter2Secure;   /*!< Specifies If the monotonic counter 2 is secured or not
                                           This parameter can be a value of @ref RTCEx_TAMP_Monotonic_Counter2_Secure */
} RTC_SecureStateTypeDef ;
/**
  * @}
  */

/** @defgroup RTCEx_Privilege_State_structure_definition RTCEx Privilege structure definition
  * @{
  */
typedef struct
{
  uint32_t rtcPrivilegeFull;            /*!< Specifies If the RTC is fully privileged or not.
                                             This parameter can be a value of @ref RTCEx_RTC_Privilege_Full. */

  uint32_t rtcPrivilegeFeatures;        /*!< Specifies the privileged features.
                                             This parameter is only relevant if RTC is not fully privileged
                                             (rtcPrivilegeFull == RTC_PRIVILEGE_FULL_NO).
                                             This parameter can be a combination of
                                             @ref RTCEx_RTC_Privilege_Features. */

  uint32_t tampPrivilegeFull;           /*!< Specifies If the TAMP is fully privileged or not execpt monotonic counters
                                             and BackUp registers.
                                             This parameter can be a value of @ref RTCEx_TAMP_Privilege_Full. */

  uint32_t backupRegisterPrivZone;      /*!< Specifies backup register zone to be privileged.
                                             This parameter can be a combination of
                                             @ref RTCEx_Backup_Reg_Privilege_zone.
                                             Warning : this parameter is writable in secure mode or
                                                       if trustzone is disabled. */


  uint32_t backupRegisterStartZone2;    /*!< Specifies the backup register start zone 2.
                                             Zone 1 : read secure write secure.
                                             Zone 2 : read non-secure  write secure.
                                             This parameter can be RTC_BKP_DRx where x can be from 0 to 31 to
                                             specify the register .
                                             Warning : this parameter is writable in secure mode or
                                                       if trustzone is disabled.
                                             Warning : this parameter is shared with RTC_SecureStateTypeDef */

  uint32_t backupRegisterStartZone3;    /*!< Specifies the backup register start zone 3.
                                             Zone 3 : read non-secure  write non-secure.
                                             This parameter can be RTC_BKP_DRx where x can be from 0 to 31 to
                                             specify the register.
                                             Warning : this parameter is writable in secure mode or
                                                       if trustzone is disabled.
                                             Warning : this parameter is shared with RTC_SecureStateTypeDef. */

  uint32_t MonotonicCounterPrivilege;  /*!< Specifies If the monotonic counter is privileged or not
                                             This parameter can be a value of
                                             @ref RTCEx_TAMP_Monotonic_Counter_Privilege */

  uint32_t MonotonicCounter2Privilege;  /*!< Specifies If the monotonic counter 2 is privileged or not
                                             This parameter can be a value of
                                             @ref RTCEx_TAMP_Monotonic_Counter2_Privilege */
} RTC_PrivilegeStateTypeDef;
/**
  * @}
  */

/** @defgroup RTCEx_Cid_State_structure_definition RTCEx CID structure definition
  * @{
  */
typedef struct
{
  uint32_t rtcCidAlrA;                 /*!< Specifies RTC Alarm A CID.
                                             This parameter can be a combination of @ref RTCEx_RTC_CID. */

  uint32_t rtcCidAlrB;                 /*!< Specifies RTC Alarm B CID.
                                             This parameter can be a combination of @ref RTCEx_RTC_CID. */

  uint32_t rtcCidWut;                  /*!< Specifies RTC Wakeup Timer CID.
                                             This parameter can be a combination of @ref RTCEx_RTC_CID. */

  uint32_t rtcCidTs;                   /*!< Specifies RTC Timestamp CID.
                                             This parameter can be a combination of @ref RTCEx_RTC_CID. */

