zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_rtc_ex.h
  uint32_t rtcCidInit;                 /*!< Specifies RTC Initialization CID.
                                             This parameter can be a combination of @ref RTCEx_RTC_CID. */

  uint32_t rtcCidCal;                  /*!< Specifies RTC Calibration CID.
                                             This parameter can be a combination of @ref RTCEx_RTC_CID. */

  uint32_t tampCidTampBk0;             /*!< Specifies TAMP and backup registers CID region 0.
                                             This parameter can be a combination of @ref RTCEx_TAMP_CID. */

  uint32_t tampCidMon1Bk1;             /*!< Specifies TAMP Monotonic counter 1 and backup registers CID region 1.
                                             This parameter can be a combination of @ref RTCEx_TAMP_CID. */

  uint32_t tampCidMon2Bk2;             /*!< Specifies TAMP Monotonic counter 2 and backup registers CID region 2.
                                             This parameter can be a combination of @ref RTCEx_TAMP_CID. */

  uint32_t backupRegisterStartZone2;    /*!< Specifies the backup register start zone 2.
                                             Zone 1 : read secure write secure.
                                             Zone 2 : read non-secure  write secure.
                                             This parameter can be RTC_BKP_DRx where x can be from 0 to 31 to
                                             specify the register .
                                             Warning : this parameter is writable in secure mode or
                                                       if trustzone is disabled.
                                             Warning : this parameter is shared with RTC_SecureStateTypeDef */

  uint32_t backupRegisterStartZone3;    /*!< Specifies the backup register start zone 3.
                                             Zone 3 : read non-secure  write non-secure.
                                             This parameter can be RTC_BKP_DRx where x can be from 0 to 31 to
                                             specify the register.
                                             Warning : this parameter is writable in secure mode or
                                                       if trustzone is disabled.
                                             Warning : this parameter is shared with RTC_SecureStateTypeDef. */

  uint32_t backupRegisterStartRif2Zone1;    /*!< Specifies the backup register start RIF 2 protection zone 1.
                                             Protection zone 3-RIF0: (Non-secure read Non-secure write)
                                             Protection zone 1-RIF1: (Secure read Secure write)
                                             Protection zone 2-RIF1: (Non-secure read Secure write)
                                             Protection zone 3-RIF1: (Non-secure read Non-secure write)
                                             Protection zone 1-RIF2: (Secure read Secure write)
                                             Protection zone 2-RIF2: (Non-secure read Secure write)
                                             Protection zone 3-RIF2: (Non-secure read Non-secure write)
                                             This parameter can be RTC_BKP_DRx where x can be from 0 to 31 to
                                             specify the register. */

  uint32_t backupRegisterStartRif2Zone2;    /*!< Specifies the backup register start RIF 2 protection zone 2.
                                             Protection zone 3-RIF0: (Non-secure read Non-secure write)
                                             Protection zone 1-RIF1: (Secure read Secure write)
                                             Protection zone 2-RIF1: (Non-secure read Secure write)
                                             Protection zone 3-RIF1: (Non-secure read Non-secure write)
                                             Protection zone 1-RIF2: (Secure read Secure write)
                                             Protection zone 2-RIF2: (Non-secure read Secure write)
                                             Protection zone 3-RIF2: (Non-secure read Non-secure write)
                                             This parameter can be RTC_BKP_DRx where x can be from 0 to 31 to
                                             specify the register. */

  uint32_t backupRegisterStartRif0Zone3;    /*!< Specifies the backup register start RIF 0 protection zone 3.
                                             Protection zone 3-RIF0: (Non-secure read Non-secure write)
                                             Protection zone 1-RIF1: (Secure read Secure write)
                                             Protection zone 2-RIF1: (Non-secure read Secure write)
                                             Protection zone 3-RIF1: (Non-secure read Non-secure write)
                                             Protection zone 1-RIF2: (Secure read Secure write)
                                             Protection zone 2-RIF2: (Non-secure read Secure write)
                                             Protection zone 3-RIF2: (Non-secure read Non-secure write)
                                             This parameter can be RTC_BKP_DRx where x can be from 0 to 31 to
                                             specify the register. */

  uint32_t backupRegisterStartRif2Zone3;    /*!< Specifies the backup register start RIF 2 protection zone 3.
                                             Protection zone 3-RIF0: (Non-secure read Non-secure write)
                                             Protection zone 1-RIF1: (Secure read Secure write)
                                             Protection zone 2-RIF1: (Non-secure read Secure write)
                                             Protection zone 3-RIF1: (Non-secure read Non-secure write)
                                             Protection zone 1-RIF2: (Secure read Secure write)
                                             Protection zone 2-RIF2: (Non-secure read Secure write)
                                             Protection zone 3-RIF2: (Non-secure read Non-secure write)
                                             This parameter can be RTC_BKP_DRx where x can be from 0 to 31 to
                                             specify the register. */
} RTC_CidStateTypeDef;
/**
  * @}
  */

/**
  * @}
  */

/* Exported constants --------------------------------------------------------*/
/** @defgroup RTCEx_Exported_Constants RTCEx Exported Constants
  * @{
  */

/** @defgroup RTCEx_Time_Stamp_Edges_definitions RTCEx Time Stamp Edges definition
  * @{
  */
#define RTC_TIMESTAMPEDGE_RISING        0x00000000u
#define RTC_TIMESTAMPEDGE_FALLING       RTC_CR_TSEDGE
/**
  * @}
  */

/** @defgroup RTCEx_TimeStamp_Pin_Selections RTCEx TimeStamp Pin Selection
  * @{
  */
#define RTC_TIMESTAMPPIN_DEFAULT              0x00000000u
/**
  * @}
  */

/** @defgroup RTCEx_Wakeup_Timer_Definitions RTCEx Wakeup Timer Definitions
  * @{
  */
#define RTC_WAKEUPCLOCK_RTCCLK_DIV16        0x00000000u
#define RTC_WAKEUPCLOCK_RTCCLK_DIV8         RTC_CR_WUCKSEL_0
#define RTC_WAKEUPCLOCK_RTCCLK_DIV4         RTC_CR_WUCKSEL_1
#define RTC_WAKEUPCLOCK_RTCCLK_DIV2         (RTC_CR_WUCKSEL_0 | RTC_CR_WUCKSEL_1)
#define RTC_WAKEUPCLOCK_CK_SPRE_16BITS      RTC_CR_WUCKSEL_2
#define RTC_WAKEUPCLOCK_CK_SPRE_17BITS      (RTC_CR_WUCKSEL_1 | RTC_CR_WUCKSEL_2)
/**
  * @}
  */

/** @defgroup RTCEx_Smooth_calib_period_Definitions RTCEx Smooth calib period Definitions
  * @{
  */
#define RTC_SMOOTHCALIB_PERIOD_32SEC   0x00000000u              /*!< If RTCCLK = 32768 Hz, Smooth calibration
                                                                     period is 32s,  else 2exp20 RTCCLK pulses */
#define RTC_SMOOTHCALIB_PERIOD_16SEC   RTC_CALR_CALW16          /*!< If RTCCLK = 32768 Hz, Smooth calibration
                                                                     period is 16s, else 2exp19 RTCCLK pulses */
#define RTC_SMOOTHCALIB_PERIOD_8SEC    RTC_CALR_CALW8           /*!< If RTCCLK = 32768 Hz, Smooth calibration
                                                                     period is 8s, else 2exp18 RTCCLK pulses */
/**
  * @}
  */

/** @defgroup RTCEx_Smooth_calib_Plus_pulses_Definitions RTCEx Smooth calib Plus pulses Definitions
  * @{
  */
#define RTC_SMOOTHCALIB_PLUSPULSES_SET    RTC_CALR_CALP         /*!< The number of RTCCLK pulses added
                                                                     during a X -second window = Y - CALM[8:0]
                                                                     with Y = 512, 256, 128 when X = 32, 16, 8 */
#define RTC_SMOOTHCALIB_PLUSPULSES_RESET  0x00000000u           /*!< The number of RTCCLK pulses subbstited
                                                                     during a 32-second window = CALM[8:0] */
/**
  * @}
  */

/** @defgroup RTCEx_Smooth_calib_low_power_Definitions RTCEx Smooth calib Low Power Definitions
  * @{
  */
#define RTC_LPCAL_SET                     RTC_CALR_LPCAL        /*!< Calibration window is 220 ck_apre,
                                                                     which is the required configuration for
                                                                     ultra-low consumption mode. */
#define RTC_LPCAL_RESET                   0x00000000u           /*!< Calibration window is 220 RTCCLK,
                                                                     which is a high-consumption mode.
                                                                     This mode should be set only when less
                                                                     than 32s calibration window is required. */
/**
  * @}
  */

/** @defgroup RTCEx_Calib_Output_selection_Definitions RTCEx Calib Output selection Definitions
  * @{
  */
#define RTC_CALIBOUTPUT_512HZ            0x00000000u
#define RTC_CALIBOUTPUT_1HZ              RTC_CR_COSEL

/**
  * @}
  */


/** @defgroup RTCEx_Add_1_Second_Parameter_Definition RTCEx Add 1 Second Parameter Definitions
  * @{
  */
#define RTC_SHIFTADD1S_RESET      0x00000000u
#define RTC_SHIFTADD1S_SET        RTC_SHIFTR_ADD1S
/**
  * @}
  */

/** @defgroup RTCEx_Tamper_Pins  RTCEx Tamper Pins Definition
  * @{
  */
#define RTC_TAMPER_1                        TAMP_CR1_TAMP1E
#define RTC_TAMPER_2                        TAMP_CR1_TAMP2E
#if (RTC_TAMP_NB == 3U)
#define RTC_TAMPER_3                         TAMP_CR1_TAMP3E
#define RTC_TAMPER_ALL                      (RTC_TAMPER_1 | RTC_TAMPER_2 | RTC_TAMPER_3 )
#elif (RTC_TAMP_NB == 7U)
#define RTC_TAMPER_3                        TAMP_CR1_TAMP3E
#define RTC_TAMPER_4                        TAMP_CR1_TAMP4E
#define RTC_TAMPER_5                        TAMP_CR1_TAMP5E
#define RTC_TAMPER_6                        TAMP_CR1_TAMP6E
#define RTC_TAMPER_7                        TAMP_CR1_TAMP7E
#define RTC_TAMPER_ALL                      (RTC_TAMPER_1 | RTC_TAMPER_2 |\
                                             RTC_TAMPER_3 | RTC_TAMPER_4 |\
                                             RTC_TAMPER_5 | RTC_TAMPER_6 |\
                                             RTC_TAMPER_7 )
#elif (RTC_TAMP_NB == 8U)
#define RTC_TAMPER_3                        TAMP_CR1_TAMP3E
#define RTC_TAMPER_4                        TAMP_CR1_TAMP4E
#define RTC_TAMPER_5                        TAMP_CR1_TAMP5E
#define RTC_TAMPER_6                        TAMP_CR1_TAMP6E
#define RTC_TAMPER_7                        TAMP_CR1_TAMP7E
#define RTC_TAMPER_8                        TAMP_CR1_TAMP8E
#define RTC_TAMPER_ALL                      (RTC_TAMPER_1 | RTC_TAMPER_2 |\
                                             RTC_TAMPER_3 | RTC_TAMPER_4 |\
                                             RTC_TAMPER_5 | RTC_TAMPER_6 |\
											                       RTC_TAMPER_7 | RTC_TAMPER_8 )
#else
#define RTC_TAMPER_ALL                      (RTC_TAMPER_1 | RTC_TAMPER_2)
#endif /* RTC_TAMP_NB */
/**
  * @}
  */

/** @defgroup RTCEx_Internal_Tamper_Pins  RTCEx Internal Tamper Pins Definition
  * @{
  */
#define RTC_INT_TAMPER_1                    TAMP_CR1_ITAMP1E
#define RTC_INT_TAMPER_2                    TAMP_CR1_ITAMP2E
#define RTC_INT_TAMPER_3                    TAMP_CR1_ITAMP3E
#define RTC_INT_TAMPER_4                    TAMP_CR1_ITAMP4E
#define RTC_INT_TAMPER_5                    TAMP_CR1_ITAMP5E
#define RTC_INT_TAMPER_6                    TAMP_CR1_ITAMP6E
#define RTC_INT_TAMPER_7                    TAMP_CR1_ITAMP7E
#define RTC_INT_TAMPER_8                    TAMP_CR1_ITAMP8E
#define RTC_INT_TAMPER_9                    TAMP_CR1_ITAMP9E
#define RTC_INT_TAMPER_10                   TAMP_CR1_ITAMP10E
#define RTC_INT_TAMPER_11                   TAMP_CR1_ITAMP11E
#define RTC_INT_TAMPER_12                   TAMP_CR1_ITAMP12E
#ifdef TAMP_CR1_ITAMP13E
#define RTC_INT_TAMPER_13                   TAMP_CR1_ITAMP13E
#endif /* TAMP_CR1_ITAMP13E */
#define RTC_INT_TAMPER_14                   TAMP_CR1_ITAMP14E
#define RTC_INT_TAMPER_15                   TAMP_CR1_ITAMP15E
#ifdef TAMP_CR1_ITAMP16E
#define RTC_INT_TAMPER_16                   TAMP_CR1_ITAMP16E
#endif /* TAMP_CR1_ITAMP16E */

#if (RTC_INT_TAMP_NB == 14U)
#define RTC_INT_TAMPER_ALL                  (RTC_INT_TAMPER_1  | RTC_INT_TAMPER_2   |\
                                             RTC_INT_TAMPER_3  | RTC_INT_TAMPER_4   |\
                                             RTC_INT_TAMPER_5  | RTC_INT_TAMPER_6   |\
                                             RTC_INT_TAMPER_7  | RTC_INT_TAMPER_8   |\
                                             RTC_INT_TAMPER_9  | RTC_INT_TAMPER_10  |\
                                             RTC_INT_TAMPER_11 | RTC_INT_TAMPER_12  |\
                                             RTC_INT_TAMPER_14 | RTC_INT_TAMPER_15)
#elif (RTC_INT_TAMP_NB == 16U)
#define RTC_INT_TAMPER_ALL                  (RTC_INT_TAMPER_1  | RTC_INT_TAMPER_2   |\
                                             RTC_INT_TAMPER_3  | RTC_INT_TAMPER_4   |\
                                             RTC_INT_TAMPER_5  | RTC_INT_TAMPER_6   |\
                                             RTC_INT_TAMPER_7  | RTC_INT_TAMPER_8   |\
                                             RTC_INT_TAMPER_9  | RTC_INT_TAMPER_10  |\
                                             RTC_INT_TAMPER_11 | RTC_INT_TAMPER_12  |\
                                             RTC_INT_TAMPER_13 | RTC_INT_TAMPER_14  |\
                                             RTC_INT_TAMPER_15 | RTC_INT_TAMPER_16)
#endif /* RTC_INT_TAMP_NB */
/**
  * @}
  */

/** @defgroup RTCEx_Tamper_Trigger  RTCEx Tamper Trigger
  * @{
  */
#define RTC_TAMPERTRIGGER_RISINGEDGE        0x00u  /*!< Warning : Filter must be RTC_TAMPERFILTER_DISABLE */
#define RTC_TAMPERTRIGGER_FALLINGEDGE       0x01u  /*!< Warning : Filter must be RTC_TAMPERFILTER_DISABLE */
#define RTC_TAMPERTRIGGER_LOWLEVEL          0x02u  /*!< Warning : Filter must not be RTC_TAMPERFILTER_DISABLE */
#define RTC_TAMPERTRIGGER_HIGHLEVEL         0x03u  /*!< Warning : Filter must not be RTC_TAMPERFILTER_DISABLE */
/**
  * @}
  */

/** @defgroup RTCEx_Tamper_MaskFlag  RTCEx Tamper MaskFlag
  * @{
  */
#define RTC_TAMPERMASK_FLAG_DISABLE         0x00u
#define RTC_TAMPERMASK_FLAG_ENABLE          0x01u
/**
  * @}
  */

/** @defgroup RTCEx_Tamper_EraseBackUp  RTCEx Tamper EraseBackUp
  * @{
  */
#define RTC_TAMPER_ERASE_BACKUP_ENABLE      0x00u
#define RTC_TAMPER_ERASE_BACKUP_DISABLE     0x01u
/**
  * @}
  */

/** @defgroup RTCEx_Tamper_Filter  RTCEx Tamper Filter
  * @{
  */
#define RTC_TAMPERFILTER_DISABLE           0x00000000U             /*!< Tamper filter is disabled */
#define RTC_TAMPERFILTER_2SAMPLE           TAMP_FLTCR_TAMPFLT_0    /*!< Tamper is activated after 2
                                                                         consecutive samples at the active level */
#define RTC_TAMPERFILTER_4SAMPLE           TAMP_FLTCR_TAMPFLT_1    /*!< Tamper is activated after 4
                                                                         consecutive samples at the active level */
#define RTC_TAMPERFILTER_8SAMPLE           TAMP_FLTCR_TAMPFLT      /*!< Tamper is activated after 8
                                                                         consecutive samples at the active level */
/**
  * @}
  */

/** @defgroup RTCEx_Tamper_Sampling_Frequencies  RTCEx Tamper Sampling Frequencies
  * @{
  */
#define RTC_TAMPERSAMPLINGFREQ_RTCCLK_DIV32768  0x00000000U                 /*!< Each of the tamper inputs are sampled with a frequency = RTCCLK / 32768 */
#define RTC_TAMPERSAMPLINGFREQ_RTCCLK_DIV16384  TAMP_FLTCR_TAMPFREQ_0       /*!< Each of the tamper inputs are sampled with a frequency = RTCCLK / 16384 */
#define RTC_TAMPERSAMPLINGFREQ_RTCCLK_DIV8192   TAMP_FLTCR_TAMPFREQ_1       /*!< Each of the tamper inputs are sampled with a frequency = RTCCLK / 8192  */
#define RTC_TAMPERSAMPLINGFREQ_RTCCLK_DIV4096   (TAMP_FLTCR_TAMPFREQ_0 | \
                                                 TAMP_FLTCR_TAMPFREQ_1)     /*!< Each of the tamper inputs are sampled with a frequency = RTCCLK / 4096  */
#define RTC_TAMPERSAMPLINGFREQ_RTCCLK_DIV2048   TAMP_FLTCR_TAMPFREQ_2       /*!< Each of the tamper inputs are sampled with a frequency = RTCCLK / 2048  */
#define RTC_TAMPERSAMPLINGFREQ_RTCCLK_DIV1024   (TAMP_FLTCR_TAMPFREQ_0 | \
                                                 TAMP_FLTCR_TAMPFREQ_2)     /*!< Each of the tamper inputs are sampled with a frequency = RTCCLK / 1024  */
#define RTC_TAMPERSAMPLINGFREQ_RTCCLK_DIV512    (TAMP_FLTCR_TAMPFREQ_1 | \
                                                 TAMP_FLTCR_TAMPFREQ_2)     /*!< Each of the tamper inputs are sampled with a frequency = RTCCLK / 512   */
#define RTC_TAMPERSAMPLINGFREQ_RTCCLK_DIV256    (TAMP_FLTCR_TAMPFREQ_0 | \
                                                 TAMP_FLTCR_TAMPFREQ_1 | \
                                                 TAMP_FLTCR_TAMPFREQ_2)     /*!< Each of the tamper inputs are sampled with a frequency = RTCCLK / 256   */
/**
  * @}
  */

