zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_rtc_ex.h
/** @defgroup RTCEx_Tamper_Pin_Precharge_Duration  RTCEx Tamper Pin Precharge Duration
  * @{
  */
#define RTC_TAMPERPRECHARGEDURATION_1RTCCLK  0x00000000U                                      /*!< Tamper pins are pre-charged before sampling during 1 RTCCLK cycle  */
#define RTC_TAMPERPRECHARGEDURATION_2RTCCLK  TAMP_FLTCR_TAMPPRCH_0                            /*!< Tamper pins are pre-charged before sampling during 2 RTCCLK cycles */
#define RTC_TAMPERPRECHARGEDURATION_4RTCCLK  TAMP_FLTCR_TAMPPRCH_1                            /*!< Tamper pins are pre-charged before sampling during 4 RTCCLK cycles */
#define RTC_TAMPERPRECHARGEDURATION_8RTCCLK  (TAMP_FLTCR_TAMPPRCH_0 | TAMP_FLTCR_TAMPPRCH_1)  /*!< Tamper pins are pre-charged before sampling during 8 RTCCLK cycles */
/**
  * @}
  */

/** @defgroup RTCEx_Tamper_Pull_UP  RTCEx Tamper Pull UP
  * @{
  */
#define RTC_TAMPER_PULLUP_ENABLE           0x00000000u           /*!< Tamper pins are pre-charged before sampling */
#define RTC_TAMPER_PULLUP_DISABLE          TAMP_FLTCR_TAMPPUDIS  /*!< Tamper pins pre-charge is disabled          */
/**
  * @}
  */

/** @defgroup RTCEx_Tamper_TimeStampOnTamperDetection RTCEx Tamper TimeStamp On Tamper Detection Definitions
  * @{
  */
#define RTC_TIMESTAMPONTAMPERDETECTION_DISABLE  0x00000000u    /*!< TimeStamp on Tamper Detection event is not saved */
#define RTC_TIMESTAMPONTAMPERDETECTION_ENABLE   RTC_CR_TAMPTS  /*!< TimeStamp on Tamper Detection event saved        */
/**
  * @}
  */

/** @defgroup RTCEx_Tamper_Interrupt  RTCEx Tamper Interrupt
  * @{
  */
#define RTC_IT_TAMP_1                      TAMP_IER_TAMP1IE     /*!< Tamper 1 Interrupt */
#define RTC_IT_TAMP_2                      TAMP_IER_TAMP2IE     /*!< Tamper 2 Interrupt */
#define RTC_IT_TAMP_3                      TAMP_IER_TAMP3IE     /*!< Tamper 3 Interrupt */
#define RTC_IT_TAMP_4                      TAMP_IER_TAMP4IE     /*!< Tamper 4 Interrupt */
#define RTC_IT_TAMP_5                      TAMP_IER_TAMP5IE     /*!< Tamper 5 Interrupt */
#define RTC_IT_TAMP_6                      TAMP_IER_TAMP6IE     /*!< Tamper 6 Interrupt */
#define RTC_IT_TAMP_7                      TAMP_IER_TAMP7IE     /*!< Tamper 7 Interrupt */
#if (RTC_TAMP_NB == 7U)
#define RTC_IT_TAMP_ALL                   (RTC_IT_TAMP_1 | RTC_IT_TAMP_2 |\
                                           RTC_IT_TAMP_3 | RTC_IT_TAMP_4 |\
                                           RTC_IT_TAMP_5 | RTC_IT_TAMP_6 |\
                                           RTC_IT_TAMP_7 )
#elif (RTC_TAMP_NB == 8U)
#define RTC_IT_TAMP_8                      TAMP_IER_TAMP8IE     /*!< Tamper 8 Interrupt */
#define RTC_IT_TAMP_ALL                   (RTC_IT_TAMP_1 | RTC_IT_TAMP_2 |\
                                           RTC_IT_TAMP_3 | RTC_IT_TAMP_4 |\
                                           RTC_IT_TAMP_5 | RTC_IT_TAMP_6 |\
                                           RTC_IT_TAMP_7 | RTC_IT_TAMP_8 )
#endif /* RTC_TAMP_NB */
/**
  * @}
  */

/** @defgroup RTCEx_Internal_Tamper_Interrupt  RTCEx Internal Tamper Interrupt
  * @{
  */
#define RTC_IT_INT_TAMP_1                   TAMP_IER_ITAMP1IE    /*!< Tamper 1 internal Interrupt  */
#define RTC_IT_INT_TAMP_2                   TAMP_IER_ITAMP2IE    /*!< Tamper 2 internal Interrupt  */
#define RTC_IT_INT_TAMP_3                   TAMP_IER_ITAMP3IE    /*!< Tamper 3 internal Interrupt  */
#define RTC_IT_INT_TAMP_4                   TAMP_IER_ITAMP4IE    /*!< Tamper 4 internal Interrupt  */
#define RTC_IT_INT_TAMP_5                   TAMP_IER_ITAMP5IE    /*!< Tamper 5 internal Interrupt  */
#define RTC_IT_INT_TAMP_6                   TAMP_IER_ITAMP6IE    /*!< Tamper 6 internal Interrupt  */
#define RTC_IT_INT_TAMP_7                   TAMP_IER_ITAMP7IE    /*!< Tamper 7 internal Interrupt  */
#define RTC_IT_INT_TAMP_8                   TAMP_IER_ITAMP8IE    /*!< Tamper 8 internal Interrupt  */
#define RTC_IT_INT_TAMP_9                   TAMP_IER_ITAMP9IE    /*!< Tamper 9 internal Interrupt  */
#define RTC_IT_INT_TAMP_10                  TAMP_IER_ITAMP10IE   /*!< Tamper 10 internal Interrupt */
#define RTC_IT_INT_TAMP_11                  TAMP_IER_ITAMP11IE   /*!< Tamper 11 internal Interrupt */
#define RTC_IT_INT_TAMP_12                  TAMP_IER_ITAMP12IE   /*!< Tamper 12 internal Interrupt */
#ifdef TAMP_IER_ITAMP13IE
#define RTC_IT_INT_TAMP_13                  TAMP_IER_ITAMP13IE   /*!< Tamper 13 internal Interrupt */
#endif /* TAMP_IER_ITAMP13IE */
#define RTC_IT_INT_TAMP_14                  TAMP_IER_ITAMP14IE   /*!< Tamper 14 internal Interrupt */
#define RTC_IT_INT_TAMP_15                  TAMP_IER_ITAMP15IE   /*!< Tamper 15 internal Interrupt */
#ifdef TAMP_IER_ITAMP16IE
#define RTC_IT_INT_TAMP_16                  TAMP_IER_ITAMP16IE   /*!< Tamper 16 internal Interrupt */
#endif /* TAMP_IER_ITAMP16IE */

#if (RTC_INT_TAMP_NB == 14U)
#define RTC_IT_INT_TAMP_ALL                (RTC_IT_INT_TAMP_1  | RTC_IT_INT_TAMP_2  |\
                                            RTC_IT_INT_TAMP_3  | RTC_IT_INT_TAMP_4  |\
                                            RTC_IT_INT_TAMP_5  | RTC_IT_INT_TAMP_6  |\
                                            RTC_IT_INT_TAMP_7  | RTC_IT_INT_TAMP_8  |\
                                            RTC_IT_INT_TAMP_9  | RTC_IT_INT_TAMP_10 |\
                                            RTC_IT_INT_TAMP_11 | RTC_IT_INT_TAMP_12 |\
                                            RTC_IT_INT_TAMP_14 | RTC_IT_INT_TAMP_15)
#elif (RTC_INT_TAMP_NB == 16U)
#define RTC_IT_INT_TAMP_ALL                (RTC_IT_INT_TAMP_1  | RTC_IT_INT_TAMP_2  |\
                                            RTC_IT_INT_TAMP_3  | RTC_IT_INT_TAMP_4  |\
                                            RTC_IT_INT_TAMP_5  | RTC_IT_INT_TAMP_6  |\
                                            RTC_IT_INT_TAMP_7  | RTC_IT_INT_TAMP_8  |\
                                            RTC_IT_INT_TAMP_9  | RTC_IT_INT_TAMP_10 |\
                                            RTC_IT_INT_TAMP_11 | RTC_IT_INT_TAMP_12 |\
                                            RTC_IT_INT_TAMP_13 | RTC_IT_INT_TAMP_14 |\
                                            RTC_IT_INT_TAMP_15 | RTC_IT_INT_TAMP_16)
#endif /* RTC_INT_TAMP_NB */
/**
  * @}
  */

/** @defgroup RTCEx_Flags  RTCEx Flags
  * @{
  */
#define RTC_FLAG_TAMP_1                    TAMP_SR_TAMP1F
#define RTC_FLAG_TAMP_2                    TAMP_SR_TAMP2F
#define RTC_FLAG_TAMP_3                    TAMP_SR_TAMP3F
#define RTC_FLAG_TAMP_4                    TAMP_SR_TAMP4F
#define RTC_FLAG_TAMP_5                    TAMP_SR_TAMP5F
#define RTC_FLAG_TAMP_6                    TAMP_SR_TAMP6F
#define RTC_FLAG_TAMP_7                    TAMP_SR_TAMP7F
#if (RTC_TAMP_NB == 7U)
#define RTC_FLAG_TAMP_ALL                 (RTC_FLAG_TAMP_1 | RTC_FLAG_TAMP_2 | RTC_FLAG_TAMP_3 |\
                                           RTC_FLAG_TAMP_4 | RTC_FLAG_TAMP_5 | RTC_FLAG_TAMP_6 |\
                                           RTC_FLAG_TAMP_7 )
#elif (RTC_TAMP_NB == 8U)
#define RTC_FLAG_TAMP_8                    TAMP_SR_TAMP8F
#define RTC_FLAG_TAMP_ALL                 (RTC_FLAG_TAMP_1 | RTC_FLAG_TAMP_2 | RTC_FLAG_TAMP_3 |\
                                           RTC_FLAG_TAMP_4 | RTC_FLAG_TAMP_5 | RTC_FLAG_TAMP_6 |\
                                           RTC_FLAG_TAMP_7 | RTC_FLAG_TAMP_8)
#endif /* RTC_TAMP_NB */

#define RTC_FLAG_INT_TAMP_1                 TAMP_SR_ITAMP1F
#define RTC_FLAG_INT_TAMP_2                 TAMP_SR_ITAMP2F
#define RTC_FLAG_INT_TAMP_3                 TAMP_SR_ITAMP3F
#define RTC_FLAG_INT_TAMP_4                 TAMP_SR_ITAMP4F
#define RTC_FLAG_INT_TAMP_5                 TAMP_SR_ITAMP5F
#define RTC_FLAG_INT_TAMP_6                 TAMP_SR_ITAMP6F
#define RTC_FLAG_INT_TAMP_7                 TAMP_SR_ITAMP7F
#define RTC_FLAG_INT_TAMP_8                 TAMP_SR_ITAMP8F
#define RTC_FLAG_INT_TAMP_9                 TAMP_SR_ITAMP9F
#define RTC_FLAG_INT_TAMP_10                TAMP_SR_ITAMP10F
#define RTC_FLAG_INT_TAMP_11                TAMP_SR_ITAMP11F
#define RTC_FLAG_INT_TAMP_12                TAMP_SR_ITAMP12F
#ifdef TAMP_SR_ITAMP13F
#define RTC_FLAG_INT_TAMP_13                TAMP_SR_ITAMP13F
#endif /* TAMP_SR_ITAMP13F */
#define RTC_FLAG_INT_TAMP_14                TAMP_SR_ITAMP14F
#define RTC_FLAG_INT_TAMP_15                TAMP_SR_ITAMP15F
#ifdef TAMP_SR_ITAMP16F
#define RTC_FLAG_INT_TAMP_16                TAMP_SR_ITAMP16F
#endif /* TAMP_SR_ITAMP16F */

#if (RTC_INT_TAMP_NB == 14U)
#define RTC_FLAG_INT_TAMP_ALL               (RTC_FLAG_INT_TAMP_1  | RTC_FLAG_INT_TAMP_2  |\
                                             RTC_FLAG_INT_TAMP_3  | RTC_FLAG_INT_TAMP_4  |\
                                             RTC_FLAG_INT_TAMP_5  | RTC_FLAG_INT_TAMP_6  |\
                                             RTC_FLAG_INT_TAMP_7  | RTC_FLAG_INT_TAMP_8  |\
                                             RTC_FLAG_INT_TAMP_9  | RTC_FLAG_INT_TAMP_10 |\
                                             RTC_FLAG_INT_TAMP_11 | RTC_FLAG_INT_TAMP_12 |\
                                             RTC_FLAG_INT_TAMP_14 | RTC_FLAG_INT_TAMP_15)
#elif (RTC_INT_TAMP_NB == 16U)
#define RTC_FLAG_INT_TAMP_ALL               (RTC_FLAG_INT_TAMP_1  | RTC_FLAG_INT_TAMP_2  |\
                                             RTC_FLAG_INT_TAMP_3  | RTC_FLAG_INT_TAMP_4  |\
                                             RTC_FLAG_INT_TAMP_5  | RTC_FLAG_INT_TAMP_6  |\
                                             RTC_FLAG_INT_TAMP_7  | RTC_FLAG_INT_TAMP_8  |\
                                             RTC_FLAG_INT_TAMP_9  | RTC_FLAG_INT_TAMP_10 |\
                                             RTC_FLAG_INT_TAMP_11 | RTC_FLAG_INT_TAMP_12 |\
                                             RTC_FLAG_INT_TAMP_13 | RTC_FLAG_INT_TAMP_14 |\
                                             RTC_FLAG_INT_TAMP_15 | RTC_FLAG_INT_TAMP_16)
#endif /* RTC_INT_TAMP_NB */
/**
  * @}
  */


/** @defgroup RTCEx_ActiveTamper_Enable RTCEx_ActiveTamper_Enable Definitions
  * @{
  */
#define RTC_ATAMP_ENABLE                   1u
#define RTC_ATAMP_DISABLE                  0u
/**
  * @}
  */

/** @defgroup RTCEx_ActiveTamper_Interrupt RTCEx_ActiveTamper_Interrupt Definitions
  * @{
  */
#define RTC_ATAMP_INTERRUPT_ENABLE        1u
#define RTC_ATAMP_INTERRUPT_DISABLE       0u
/**
  * @}
  */

/** @defgroup RTCEx_ActiveTamper_Filter RTCEx_ActiveTamper_Filter Definitions
  * @{
  */
#define RTC_ATAMP_FILTER_ENABLE           TAMP_ATCR1_FLTEN
#define RTC_ATAMP_FILTER_DISABLE          0u
/**
  * @}
  */

/** @defgroup RTCEx_ActiveTamper_Async_prescaler RTCEx Active_Tamper_Asynchronous_Prescaler clock Definitions
  * @{
  */
#define RTC_ATAMP_ASYNCPRES_RTCCLK        0u                                                                      /*!< RTCCLK */
#define RTC_ATAMP_ASYNCPRES_RTCCLK_2      TAMP_ATCR1_ATCKSEL_0                                                    /*!< RTCCLK/2 */
#define RTC_ATAMP_ASYNCPRES_RTCCLK_4      TAMP_ATCR1_ATCKSEL_1                                                    /*!< RTCCLK/4 */
#define RTC_ATAMP_ASYNCPRES_RTCCLK_8     (TAMP_ATCR1_ATCKSEL_1 | TAMP_ATCR1_ATCKSEL_0)                            /*!< RTCCLK/8 */
#define RTC_ATAMP_ASYNCPRES_RTCCLK_16     TAMP_ATCR1_ATCKSEL_2                                                    /*!< RTCCLK/16 */
#define RTC_ATAMP_ASYNCPRES_RTCCLK_32    (TAMP_ATCR1_ATCKSEL_2 | TAMP_ATCR1_ATCKSEL_0)                            /*!< RTCCLK/32 */
#define RTC_ATAMP_ASYNCPRES_RTCCLK_64    (TAMP_ATCR1_ATCKSEL_2 | TAMP_ATCR1_ATCKSEL_1)                            /*!< RTCCLK/64 */
#define RTC_ATAMP_ASYNCPRES_RTCCLK_128   (TAMP_ATCR1_ATCKSEL_2 | TAMP_ATCR1_ATCKSEL_1 | TAMP_ATCR1_ATCKSEL_0)     /*!< RTCCLK/128 */
#define RTC_ATAMP_ASYNCPRES_RTCCLK_2048  (TAMP_ATCR1_ATCKSEL_3 | TAMP_ATCR1_ATCKSEL_1 | TAMP_ATCR1_ATCKSEL_0)     /*!< RTCCLK/2048 */
/**
  * @}
  */

