zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_rtc_ex.h
/** @defgroup RTCEx_RTC_Secure_Full  RTCEx Secure Definition
  * @{
  */
#define RTC_SECURE_FULL_YES                 RTC_SECCFGR_SEC                   /*!< RTC full secure */
#define RTC_SECURE_FULL_NO                  0u                                /*!< RTC is not full secure, features can be unsecure. See RTC_LL_EC_UNSECURE_RTC_FEATURE */
/**
  * @}
  */

/** @defgroup RTCEx_RTC_Secure_Features  RTCEx Secure Features Definition
  * @{
  */

#define RTC_SECURE_FEATURE_NONE            0u
#define RTC_SECURE_FEATURE_INIT            RTC_SECCFGR_INITSEC  /*!< Initialization */
#define RTC_SECURE_FEATURE_CAL             RTC_SECCFGR_CALSEC   /*!< Calibration */
#define RTC_SECURE_FEATURE_TS              RTC_SECCFGR_TSSEC    /*!< Time stamp */
#define RTC_SECURE_FEATURE_WUT             RTC_SECCFGR_WUTSEC   /*!< Wake up timer */
#define RTC_SECURE_FEATURE_ALRA            RTC_SECCFGR_ALRASEC  /*!< Alarm A */
#define RTC_SECURE_FEATURE_ALRB            RTC_SECCFGR_ALRBSEC  /*!< Alarm B */
#define RTC_SECURE_FEATURE_ALL             (RTC_SECCFGR_INITSEC |  RTC_SECCFGR_CALSEC | \
                                            RTC_SECCFGR_TSSEC | RTC_SECCFGR_WUTSEC | \
                                            RTC_SECCFGR_ALRASEC | RTC_SECCFGR_ALRBSEC)
/**
  * @}
  */

/** @defgroup RTCEx_TAMP_Secure_Full  RTCEx TAMP Secure Definition
  * @{
  */
#define TAMP_SECURE_FULL_YES                 TAMP_SECCFGR_TAMPSEC      /*!< TAMPER full secure */
#define TAMP_SECURE_FULL_NO                  0u                        /*!< TAMPER is not secure */
/**
  * @}
  */

/** @defgroup RTCEx_TAMP_Monotonic_Counter_Secure  RTCEx TAMP Monotonic Counter 1 Secure Definition
  * @{
  */
#define TAMP_MONOTONIC_CNT_SECURE_YES                 TAMP_SECCFGR_CNT1SEC      /*!< TAMPER Monotonic Counter 1 secure */
#define TAMP_MONOTONIC_CNT_SECURE_NO                  0u                        /*!< TAMPER Monotonic Counter 1 is not secure */
/**
  * @}
  */

/** @defgroup RTCEx_TAMP_Monotonic_Counter2_Secure  RTCEx TAMP Monotonic Counter 2 Secure Definition
  * @{
  */
#define TAMP_MONOTONIC_CNT2_SECURE_YES                TAMP_SECCFGR_CNT2SEC      /*!< TAMPER Monotonic Counter 2 secure */
#define TAMP_MONOTONIC_CNT2_SECURE_NO                 0u                        /*!< TAMPER Monotonic Counter 2 is not secure */
/**
  * @}
  */

/** @defgroup RTCEx_RTC_Privilege_Full  RTCEx Privilege Full Definition
  * @{
  */
#define RTC_PRIVILEGE_FULL_YES               RTC_PRIVCR_PRIV
#define RTC_PRIVILEGE_FULL_NO                0u
/**
  * @}
  */

/** @defgroup RTCEx_RTC_Privilege_Features  RTCEx Privilege Features Definition
  * @{
  */
#define RTC_PRIVILEGE_FEATURE_NONE           0u
#define RTC_PRIVILEGE_FEATURE_INIT           RTC_PRIVCR_INITPRIV  /*!< Initialization */
#define RTC_PRIVILEGE_FEATURE_CAL            RTC_PRIVCR_CALDPRIV  /*!< Calibration */
#define RTC_PRIVILEGE_FEATURE_TS             RTC_PRIVCR_TSDPRIV   /*!< Time stamp */
#define RTC_PRIVILEGE_FEATURE_WUT            RTC_PRIVCR_WUTPRIV   /*!< Wake up timer */
#define RTC_PRIVILEGE_FEATURE_ALRA           RTC_PRIVCR_ALRAPRIV  /*!< Alarm A */
#define RTC_PRIVILEGE_FEATURE_ALRB           RTC_PRIVCR_ALRBPRIV  /*!< Alarm B */
#define RTC_PRIVILEGE_FEATURE_ALL            (RTC_PRIVCR_INITPRIV |  RTC_PRIVCR_CALPRIV | \
                                              RTC_PRIVCR_TSPRIV | RTC_PRIVCR_WUTPRIV | \
                                              RTC_PRIVCR_ALRAPRIV | RTC_PRIVCR_ALRBPRIV)
/**
  * @}
  */

/** @defgroup RTCEx_TAMP_Privilege_Full  RTCEx TAMP security Definition
  * @{
  */
#define TAMP_PRIVILEGE_FULL_YES              TAMP_PRIVCR_TAMPPRIV
#define TAMP_PRIVILEGE_FULL_NO               0u
/**
  * @}
  */

/** @defgroup RTCEx_TAMP_Monotonic_Counter_Privilege  RTCEx TAMP Monotonic Counter 1 Privilege Definition
  * @{
  */
#define TAMP_MONOTONIC_CNT_PRIVILEGE_YES     TAMP_PRIVCR_CNT1PRIV
#define TAMP_MONOTONIC_CNT_PRIVILEGE_NO      0u
/**
  * @}
  */

/** @defgroup RTCEx_TAMP_Monotonic_Counter2_Privilege  RTCEx TAMP Monotonic Counter 2 Privilege Definition
  * @{
  */
#define TAMP_MONOTONIC_CNT2_PRIVILEGE_YES    TAMP_PRIVCR_CNT2PRIV
#define TAMP_MONOTONIC_CNT2_PRIVILEGE_NO     0u
/**
  * @}
  */

/** @defgroup RTCEx_Backup_Reg_Privilege_zone  RTCEx Privilege Backup register privilege zone Definition
  * @{
  */
#define RTC_PRIVILEGE_BKUP_ZONE_NONE         0u
#define RTC_PRIVILEGE_BKUP_ZONE_1            TAMP_PRIVCR_BKPRWPRIV
#define RTC_PRIVILEGE_BKUP_ZONE_2            TAMP_PRIVCR_BKPWPRIV
#define RTC_PRIVILEGE_BKUP_ZONE_ALL          (RTC_PRIVILEGE_BKUP_ZONE_1 |  RTC_PRIVILEGE_BKUP_ZONE_2)
/**
  * @}
  */

/** @defgroup RTCEx_RTC_CID  RTCEx CID Definition
  * @{
  */
#define RTC_CID_DISABLE                      (0x80000000u)
#define RTC_CID_0                            (0u << RTC_RCIDCFGR_CID_Pos)
#define RTC_CID_1                            (1u << RTC_RCIDCFGR_CID_Pos)
#define RTC_CID_2                            (2u << RTC_RCIDCFGR_CID_Pos)
#define RTC_CID_3                            (3u << RTC_RCIDCFGR_CID_Pos)
/**
  * @}
  */

/** @defgroup RTCEx_TAMP_CID  RTCEx TAMP CID Definition
  * @{
  */
#define TAMP_CID_DISABLE                     (0x80000000u)
#define TAMP_CID_0                           (0u << TAMP_RCIDCFGR_CID_Pos)
#define TAMP_CID_1                           (1u << TAMP_RCIDCFGR_CID_Pos)
#define TAMP_CID_2                           (2u << TAMP_RCIDCFGR_CID_Pos)
#define TAMP_CID_3                           (3u << TAMP_RCIDCFGR_CID_Pos)
/**
  * @}
  */

/**
  * @}
  */

/* Exported macros -----------------------------------------------------------*/
/** @defgroup RTCEx_Exported_Macros RTCEx Exported Macros
  * @{
  */

/** @brief  Clear the specified RTC pending flag.
  * @param  __HANDLE__ specifies the RTC Handle.
  * @param  __FLAG__ specifies the flag to check.
  *          This parameter can be any combination of the following values:
  *            @arg @ref RTC_CLEAR_ITSF               Clear Internal Time-stamp flag
  *            @arg @ref RTC_CLEAR_TSOVF              Clear Time-stamp overflow flag
  *            @arg @ref RTC_CLEAR_TSF                Clear Time-stamp flag
  *            @arg @ref RTC_CLEAR_WUTF               Clear Wakeup timer flag
  *            @arg @ref RTC_CLEAR_ALRBF              Clear Alarm B flag
  *            @arg @ref RTC_CLEAR_ALRAF              Clear Alarm A flag
  * @retval None
  */
#define __HAL_RTC_CLEAR_FLAG(__HANDLE__, __FLAG__)   (RTC->SCR = (__FLAG__))

/** @brief  Check whether the specified RTC flag is set or not.
  * @param  __HANDLE__ specifies the RTC Handle.
  * @param  __FLAG__ specifies the flag to check.
  *          This parameter can be any combination of the following values:
  *            @arg @ref RTC_FLAG_RECALPF             Recalibration pending Flag
  *            @arg @ref RTC_FLAG_INITF               Initialization flag
  *            @arg @ref RTC_FLAG_RSF                 Registers synchronization flag
  *            @arg @ref RTC_FLAG_INITS               Initialization status flag
  *            @arg @ref RTC_FLAG_SHPF                Shift operation pending flag
  *            @arg @ref RTC_FLAG_WUTWF               Wakeup timer write flag
  *            @arg @ref RTC_FLAG_ITSF                Internal Time-stamp flag
  *            @arg @ref RTC_FLAG_TSOVF               Time-stamp overflow flag
  *            @arg @ref RTC_FLAG_TSF                 Time-stamp flag
  *            @arg @ref RTC_FLAG_WUTF                Wakeup timer flag
  *            @arg @ref RTC_FLAG_ALRBF               Alarm B flag
  *            @arg @ref RTC_FLAG_ALRAF               Alarm A flag
  * @retval None
  */
#define __HAL_RTC_GET_FLAG(__HANDLE__, __FLAG__)    ( \
                                                      ((((__FLAG__)) >> 8U) == 1U)                                   \
                                                      ?                                                              \
                                                      (RTC->ICSR & (1U << (((uint16_t)(__FLAG__)) & RTC_IT_MASK)))   \
                                                      :                                                              \
                                                      (RTC->SR & (1U << (((uint16_t)(__FLAG__)) & RTC_IT_MASK)))     \
                                                    )

/* ---------------------------------WAKEUPTIMER---------------------------------*/
/** @defgroup RTCEx_WakeUp_Timer RTC WakeUp Timer
  * @{
  */
/**
  * @brief  Enable the RTC WakeUp Timer peripheral.
  * @param  __HANDLE__ specifies the RTC handle.
  * @retval None
  */
#define __HAL_RTC_WAKEUPTIMER_ENABLE(__HANDLE__)                      (RTC->CR |= (RTC_CR_WUTE))

/**
  * @brief  Disable the RTC WakeUp Timer peripheral.
  * @param  __HANDLE__ specifies the RTC handle.
  * @retval None
  */
#define __HAL_RTC_WAKEUPTIMER_DISABLE(__HANDLE__)                     (RTC->CR &= ~(RTC_CR_WUTE))

/**
  * @brief  Enable the RTC WakeUpTimer interrupt.
  * @param  __HANDLE__ specifies the RTC handle.
  * @param  __INTERRUPT__ specifies the RTC WakeUpTimer interrupt sources to be enabled.
  *         This parameter can be:
  *            @arg @ref RTC_IT_WUT WakeUpTimer interrupt
  * @retval None
  */
#define __HAL_RTC_WAKEUPTIMER_ENABLE_IT(__HANDLE__, __INTERRUPT__)    (RTC->CR |= (__INTERRUPT__))

/**
  * @brief  Disable the RTC WakeUpTimer interrupt.
  * @param  __HANDLE__ specifies the RTC handle.
  * @param  __INTERRUPT__ specifies the RTC WakeUpTimer interrupt sources to be disabled.
  *         This parameter can be:
  *            @arg @ref RTC_IT_WUT WakeUpTimer interrupt
  * @retval None
  */
#define __HAL_RTC_WAKEUPTIMER_DISABLE_IT(__HANDLE__, __INTERRUPT__)   (RTC->CR &= ~(__INTERRUPT__))


/**
  * @brief  Check whether the specified RTC WakeUpTimer interrupt has occurred or not.
  * @param  __HANDLE__ specifies the RTC handle.
  * @param  __INTERRUPT__ specifies the RTC WakeUpTimer interrupt to check.
  *         This parameter can be:
  *            @arg @ref RTC_IT_WUT  WakeUpTimer interrupt
  * @retval None
  */
#define __HAL_RTC_WAKEUPTIMER_GET_IT(__HANDLE__, __INTERRUPT__)       ((((RTC->MISR) &\
                                                                         ((__INTERRUPT__)>> 12U)) != 0UL) ? 1UL : 0UL)
/**
  * @brief  Check whether the specified RTC Wake Up timer interrupt has been enabled or not.
  * @param  __HANDLE__ specifies the RTC handle.
  * @param  __INTERRUPT__ specifies the RTC Wake Up timer interrupt sources to check.
  *         This parameter can be:
  *            @arg @ref RTC_IT_WUT  WakeUpTimer interrupt
  * @retval None
  */
#define __HAL_RTC_WAKEUPTIMER_GET_IT_SOURCE(__HANDLE__, __INTERRUPT__)   ((((RTC->CR) &\
                                                                            (__INTERRUPT__)) != 0UL) ? 1UL : 0UL)

/**
  * @brief  Get the selected RTC WakeUpTimers flag status.
  * @param  __HANDLE__ specifies the RTC handle.
  * @param  __FLAG__ specifies the RTC WakeUpTimer Flag is pending or not.
  *          This parameter can be:
  *             @arg @ref RTC_FLAG_WUTF
  *             @arg @ref RTC_FLAG_WUTWF
  * @retval None
  */
#define __HAL_RTC_WAKEUPTIMER_GET_FLAG(__HANDLE__, __FLAG__)   (__HAL_RTC_GET_FLAG((__HANDLE__), (__FLAG__)))

/**
  * @brief  Clear the RTC Wake Up timers pending flags.
  * @param  __HANDLE__ specifies the RTC handle.
  * @param  __FLAG__ specifies the RTC WakeUpTimer Flag to clear.
  *         This parameter can be:
  *            @arg @ref RTC_FLAG_WUTF
  * @retval None
  */
#define __HAL_RTC_WAKEUPTIMER_CLEAR_FLAG(__HANDLE__, __FLAG__)     (__HAL_RTC_CLEAR_FLAG((__HANDLE__), RTC_CLEAR_WUTF))

