zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_rtc_ex.h
/* Extended RTC features functions *******************************************/
/** @defgroup RTCEx_Exported_Functions_Group4 Extended features functions
  * @{
  */

void              HAL_RTCEx_AlarmBEventCallback(RTC_HandleTypeDef *hrtc);
HAL_StatusTypeDef HAL_RTCEx_PollForAlarmBEvent(RTC_HandleTypeDef *hrtc, uint32_t Timeout);
/**
  * @}
  */

/** @defgroup RTCEx_Exported_Functions_Group5 Extended RTC Tamper functions
  * @{
  */
HAL_StatusTypeDef HAL_RTCEx_SetTamper(const RTC_HandleTypeDef *hrtc, const RTC_TamperTypeDef *sTamper);
HAL_StatusTypeDef HAL_RTCEx_SetActiveTampers(RTC_HandleTypeDef *hrtc, const RTC_ActiveTampersTypeDef *sAllTamper);
HAL_StatusTypeDef HAL_RTCEx_SetActiveSeed(RTC_HandleTypeDef *hrtc, const uint32_t *pSeed);
HAL_StatusTypeDef HAL_RTCEx_SetTamper_IT(const RTC_HandleTypeDef *hrtc, const RTC_TamperTypeDef *sTamper);
HAL_StatusTypeDef HAL_RTCEx_DeactivateTamper(const RTC_HandleTypeDef *hrtc, uint32_t Tamper);
HAL_StatusTypeDef HAL_RTCEx_DeactivateActiveTampers(const RTC_HandleTypeDef *hrtc);
HAL_StatusTypeDef HAL_RTCEx_PollForTamperEvent(const RTC_HandleTypeDef *hrtc, uint32_t Tamper, uint32_t Timeout);
HAL_StatusTypeDef HAL_RTCEx_SetInternalTamper(const RTC_HandleTypeDef *hrtc,
                                              const RTC_InternalTamperTypeDef *sIntTamper);
HAL_StatusTypeDef HAL_RTCEx_SetInternalTamper_IT(const RTC_HandleTypeDef *hrtc,
                                                 const RTC_InternalTamperTypeDef *sIntTamper);
HAL_StatusTypeDef HAL_RTCEx_DeactivateInternalTamper(const RTC_HandleTypeDef *hrtc, uint32_t IntTamper);
HAL_StatusTypeDef HAL_RTCEx_PollForInternalTamperEvent(const RTC_HandleTypeDef *hrtc, uint32_t IntTamper,
                                                       uint32_t Timeout);
void              HAL_RTCEx_TamperIRQHandler(RTC_HandleTypeDef *hrtc);
void              HAL_RTCEx_Tamper1EventCallback(RTC_HandleTypeDef *hrtc);
void              HAL_RTCEx_Tamper2EventCallback(RTC_HandleTypeDef *hrtc);
void              HAL_RTCEx_Tamper3EventCallback(RTC_HandleTypeDef *hrtc);
void              HAL_RTCEx_Tamper4EventCallback(RTC_HandleTypeDef *hrtc);
void              HAL_RTCEx_Tamper5EventCallback(RTC_HandleTypeDef *hrtc);
void              HAL_RTCEx_Tamper6EventCallback(RTC_HandleTypeDef *hrtc);
void              HAL_RTCEx_Tamper7EventCallback(RTC_HandleTypeDef *hrtc);
#ifdef RTC_TAMPER_8
void              HAL_RTCEx_Tamper8EventCallback(RTC_HandleTypeDef *hrtc);
#endif /* RTC_TAMPER_8 */
void              HAL_RTCEx_InternalTamper1EventCallback(RTC_HandleTypeDef *hrtc);
void              HAL_RTCEx_InternalTamper2EventCallback(RTC_HandleTypeDef *hrtc);
void              HAL_RTCEx_InternalTamper3EventCallback(RTC_HandleTypeDef *hrtc);
void              HAL_RTCEx_InternalTamper4EventCallback(RTC_HandleTypeDef *hrtc);
void              HAL_RTCEx_InternalTamper5EventCallback(RTC_HandleTypeDef *hrtc);
void              HAL_RTCEx_InternalTamper6EventCallback(RTC_HandleTypeDef *hrtc);
void              HAL_RTCEx_InternalTamper7EventCallback(RTC_HandleTypeDef *hrtc);
void              HAL_RTCEx_InternalTamper8EventCallback(RTC_HandleTypeDef *hrtc);
void              HAL_RTCEx_InternalTamper9EventCallback(RTC_HandleTypeDef *hrtc);
void              HAL_RTCEx_InternalTamper10EventCallback(RTC_HandleTypeDef *hrtc);
void              HAL_RTCEx_InternalTamper11EventCallback(RTC_HandleTypeDef *hrtc);
void              HAL_RTCEx_InternalTamper12EventCallback(RTC_HandleTypeDef *hrtc);
#ifdef RTC_INT_TAMPER_13
void              HAL_RTCEx_InternalTamper13EventCallback(RTC_HandleTypeDef *hrtc);
#endif /* RTC_INT_TAMPER_13 */
void              HAL_RTCEx_InternalTamper14EventCallback(RTC_HandleTypeDef *hrtc);
void              HAL_RTCEx_InternalTamper15EventCallback(RTC_HandleTypeDef *hrtc);
#ifdef RTC_INT_TAMPER_16
void              HAL_RTCEx_InternalTamper16EventCallback(RTC_HandleTypeDef *hrtc);
#endif /* RTC_INT_TAMPER_16 */
HAL_StatusTypeDef HAL_RTCEx_SetVcoreMonitor(RTC_HandleTypeDef *hrtc);
HAL_StatusTypeDef HAL_RTCEx_DeactivateVcoreMonitor(RTC_HandleTypeDef *hrtc);
HAL_StatusTypeDef HAL_RTCEx_SetSwMasterKey(const RTC_HandleTypeDef *hrtc);
/**
  * @}
  */

/** @defgroup RTCEx_Exported_Functions_Group6 Extended RTC Backup register functions
  * @{
  */
void              HAL_RTCEx_BKUPWrite(const RTC_HandleTypeDef *hrtc, uint32_t BackupRegister, uint32_t Data);
uint32_t          HAL_RTCEx_BKUPRead(const RTC_HandleTypeDef *hrtc, uint32_t BackupRegister);
void              HAL_RTCEx_BKUPErase(const RTC_HandleTypeDef *hrtc);
/**
  * @}
  */

/** @defgroup RTCEx_Exported_Functions_Group7 Extended RTC secure functions
  * @{
  */
HAL_StatusTypeDef HAL_RTCEx_SecureModeGet(const RTC_HandleTypeDef *hrtc, RTC_SecureStateTypeDef  *secureState);
HAL_StatusTypeDef HAL_RTCEx_SecureModeSet(const RTC_HandleTypeDef *hrtc, const RTC_SecureStateTypeDef  *secureState);
/**
  * @}
  */

/** @defgroup RTCEx_Exported_Functions_Group8 Extended RTC privilege functions
  * @{
  */
HAL_StatusTypeDef HAL_RTCEx_PrivilegeModeSet(const RTC_HandleTypeDef *hrtc,
                                             const RTC_PrivilegeStateTypeDef *privilegeState);
HAL_StatusTypeDef HAL_RTCEx_PrivilegeModeGet(const RTC_HandleTypeDef *hrtc, RTC_PrivilegeStateTypeDef *privilegeState);
/**
  * @}
  */

/** @defgroup RTCEx_Exported_Functions_Group9 Extended RTC CID filtering functions
  * @{
  */
HAL_StatusTypeDef HAL_RTCEx_CidModeSet(const RTC_HandleTypeDef *hrtc, const RTC_CidStateTypeDef *cidState);
HAL_StatusTypeDef HAL_RTCEx_CidModeGet(const RTC_HandleTypeDef *hrtc, RTC_CidStateTypeDef *cidState);
/**
  * @}
  */

/**
  * @}
  */

/* Private types -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private constants ---------------------------------------------------------*/
/** @defgroup RTCEx_Private_Constants RTCEx Private Constants
  * @{
  */
#if defined (CORTEX_IN_SECURE_STATE)
#if defined (CORE_CA35)
#define RTC_EXTI_LINE_TIMESTAMP_EVENT         EXTI2_IMR1_IM22 /*!< External interrupt line 17 Connected to the RTC Time Stamp events */
#define RTC_EXTI_LINE_WAKEUPTIMER_EVENT       EXTI2_IMR1_IM22 /*!< External interrupt line 17 Connected to the RTC Wakeup event */
#define RTC_EXTI_LINE_TAMPER_EVENT            EXTI2_IMR1_IM21 /*!< External interrupt line 19 Connected to the RTC tamper events */
#define RTC_EXTI_LINE_SSRU_EVENT              EXTI2_IMR1_IM22 /*!< External interrupt line 18 Connected to the RTC SSR Underflow event  */
#elif defined (CORE_CM33)
#define RTC_EXTI_LINE_TIMESTAMP_EVENT         EXTI2_IMR1_IM24 /*!< External interrupt line 22 Connected to the RTC Time Stamp events */
#define RTC_EXTI_LINE_WAKEUPTIMER_EVENT       EXTI2_IMR1_IM24 /*!< External interrupt line 22 Connected to the RTC Wakeup event */
#define RTC_EXTI_LINE_TAMPER_EVENT            EXTI2_IMR1_IM23 /*!< External interrupt line 23 Connected to the RTC tamper events */
#define RTC_EXTI_LINE_SSRU_EVENT              EXTI2_IMR1_IM24 /*!< External interrupt line 22 Connected to the RTC SSR Underflow event  */
#endif /* COREs */
#else /* Non secure state */
#if defined (CORE_CA35)
#define RTC_EXTI_LINE_TIMESTAMP_EVENT         EXTI2_IMR1_IM17 /*!< External interrupt line 17 Connected to the RTC Time Stamp events */
#define RTC_EXTI_LINE_WAKEUPTIMER_EVENT       EXTI2_IMR1_IM17 /*!< External interrupt line 17 Connected to the RTC Wakeup event */
#define RTC_EXTI_LINE_TAMPER_EVENT            EXTI2_IMR1_IM16 /*!< External interrupt line 19 Connected to the RTC tamper events */
#define RTC_EXTI_LINE_SSRU_EVENT              EXTI2_IMR1_IM17 /*!< External interrupt line 18 Connected to the RTC SSR Underflow event  */
#elif defined (CORE_CM33)
#define RTC_EXTI_LINE_TIMESTAMP_EVENT         EXTI2_IMR1_IM19 /*!< External interrupt line 22 Connected to the RTC Time Stamp events */
#define RTC_EXTI_LINE_WAKEUPTIMER_EVENT       EXTI2_IMR1_IM18 /*!< External interrupt line 22 Connected to the RTC Wakeup event */
#define RTC_EXTI_LINE_TAMPER_EVENT            EXTI2_IMR1_IM19 /*!< External interrupt line 23 Connected to the RTC tamper events */
#define RTC_EXTI_LINE_SSRU_EVENT              EXTI2_IMR1_IM19 /*!< External interrupt line 22 Connected to the RTC SSR Underflow event  */
#elif defined (CORE_CM0PLUS)
#define RTC_EXTI_LINE_TIMESTAMP_EVENT         0 /*!< No RTC Time Stamp events it line for cpu 3 */
#define RTC_EXTI_LINE_WAKEUPTIMER_EVENT       0 /*!< No RTC Wakeup event It line for cpu 3*/
#define RTC_EXTI_LINE_TAMPER_EVENT            EXTI2_IMR1_IM20 /*!< External interrupt line 19 Connected to the RTC tamper events */
#define RTC_EXTI_LINE_SSRU_EVENT              0 /*!< No RTC SSR Underflow It line for cpu 3 */
#endif /* COREs */
#endif /* CORTEX_IN_SECURE_STATE */

/**
  * @}
  */

