zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_rtc_ex.h
#define IS_RTC_CALIB_OUTPUT(OUTPUT)  (((OUTPUT) == RTC_CALIBOUTPUT_512HZ) || \
                                      ((OUTPUT) == RTC_CALIBOUTPUT_1HZ))

#define IS_RTC_SECURE_FULL(__STATE__) (((__STATE__) == RTC_SECURE_FULL_YES) || \
                                       ((__STATE__) == RTC_SECURE_FULL_NO))

#define IS_RTC_SECURE_FEATURES(__FEATURES__) (((__FEATURES__) & ~RTC_SECURE_FEATURE_ALL) == 0u)

#define IS_TAMP_SECURE_FULL(__STATE__) (((__STATE__) == TAMP_SECURE_FULL_YES) || \
                                        ((__STATE__) == TAMP_SECURE_FULL_NO))

#define IS_TAMP_MONOTONIC_CNT_SECURE(__STATE__) (((__STATE__) == TAMP_MONOTONIC_CNT_SECURE_YES) || \
                                                 ((__STATE__) == TAMP_MONOTONIC_CNT_SECURE_NO))

#define IS_TAMP_MONOTONIC_CNT2_SECURE(__STATE__) (((__STATE__) == TAMP_MONOTONIC_CNT2_SECURE_YES) || \
                                                  ((__STATE__) == TAMP_MONOTONIC_CNT2_SECURE_NO))

#define IS_RTC_PRIVILEGE_FULL(__STATE__) (((__STATE__) == RTC_PRIVILEGE_FULL_YES) || \
                                          ((__STATE__) == RTC_PRIVILEGE_FULL_NO))

#define IS_RTC_PRIVILEGE_FEATURES(__FEATURES__) (((__FEATURES__) & ~RTC_PRIVILEGE_FEATURE_ALL) == 0u)

#define IS_TAMP_PRIVILEGE_FULL(__STATE__) (((__STATE__) == TAMP_PRIVILEGE_FULL_YES) || \
                                           ((__STATE__) == TAMP_PRIVILEGE_FULL_NO))

#define IS_TAMP_MONOTONIC_CNT_PRIVILEGE(__STATE__) (((__STATE__) == TAMP_MONOTONIC_CNT_PRIVILEGE_YES) || \
                                                    ((__STATE__) == TAMP_MONOTONIC_CNT_PRIVILEGE_NO))

#define IS_TAMP_MONOTONIC_CNT2_PRIVILEGE(__STATE__) (((__STATE__) == TAMP_MONOTONIC_CNT2_PRIVILEGE_YES) || \
                                                     ((__STATE__) == TAMP_MONOTONIC_CNT2_PRIVILEGE_NO))

#define IS_RTC_CID(__STATE__) (((__STATE__) == RTC_CID_0) || \
                               ((__STATE__) == RTC_CID_1) || \
                               ((__STATE__) == RTC_CID_2) || \
                               ((__STATE__) == RTC_CID_3) || \
                               ((__STATE__) == RTC_CID_DISABLE))

#define IS_TAMP_CID(__STATE__) (((__STATE__) == TAMP_CID_0) || \
                                ((__STATE__) == TAMP_CID_1) || \
                                ((__STATE__) == TAMP_CID_2) || \
                                ((__STATE__) == TAMP_CID_3) || \
                                ((__STATE__) == TAMP_CID_DISABLE))

#define IS_RTC_PRIVILEGE_BKUP_ZONE(__ZONES__) (((__ZONES__) & ~RTC_PRIVILEGE_BKUP_ZONE_ALL) == 0u)

#define IS_RTC_BINARY_MODE(MODE) (((MODE) == RTC_BINARY_NONE) || \
                                  ((MODE) == RTC_BINARY_ONLY) || \
                                  ((MODE) == RTC_BINARY_MIX ))

#define IS_RTC_BINARY_MIX_BCDU(BDCU) (((BDCU) == RTC_BINARY_MIX_BCDU_0) || \
                                      ((BDCU) == RTC_BINARY_MIX_BCDU_1) || \
                                      ((BDCU) == RTC_BINARY_MIX_BCDU_2) || \
                                      ((BDCU) == RTC_BINARY_MIX_BCDU_3) || \
                                      ((BDCU) == RTC_BINARY_MIX_BCDU_4) || \
                                      ((BDCU) == RTC_BINARY_MIX_BCDU_5) || \
                                      ((BDCU) == RTC_BINARY_MIX_BCDU_6) || \
                                      ((BDCU) == RTC_BINARY_MIX_BCDU_7))

#define IS_RTC_ALARM_SUB_SECOND_BINARY_MASK(MASK)   ( \
                                                      ((MASK) == 0u)                                   \
                                                      ||                                               \
                                                      ( \
                                                        ((MASK) >= RTC_ALARMSUBSECONDBINMASK_SS31_1)   \
                                                        &&                                             \
                                                        ((MASK) <= RTC_ALARMSUBSECONDBINMASK_NONE)     \
                                                      )                                                \
                                                    )

#define IS_RTC_ALARMSUBSECONDBIN_AUTOCLR(SEL) (((SEL) == RTC_ALARMSUBSECONDBIN_AUTOCLR_NO) || \
                                               ((SEL) == RTC_ALARMSUBSECONDBIN_AUTOCLR_YES))
/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* __STM32MP2xx_HAL_RTC_EX_H */
